Public Member Functions | List of all members
ACAPI::MEP::RoutingSegmentDefault::Modifier Class Reference
MEP Element Manager
Modifier of the RoutingSegmentDefault. More...
#include <MEPRoutingSegmentDefault.hpp>
 Inheritance diagram for ACAPI::MEP::RoutingSegmentDefault::Modifier:
 Public Member Functions
void  | SetRigidSegmentDefault (const RigidSegmentDefault &rigidSegmentDefault) const
Sets the RigidSegment to the RoutingSegmentDefault.
Result< void >  | SetCrossSectionWidth (double width)
Sets the width of the RoutingSegmentDefault.
Result< void >  | SetCrossSectionHeight (double height)
Sets the width of the RoutingSegmentDefault.
Result< void >  | SetCrossSectionShape (ConnectorShape shape)
Sets the shape of the RoutingSegmentDefault.
Result< void >  | SetCrossSectionReferenceId (uint32_t referenceId)
Sets the referenceId of Circular Cross Section in the RoutingSegmentDefault.
Result< void >  | SetPreferenceTableId (const UniqueID &uniqueId)
Sets the PreferenceTable of the RoutingSegmentDefault.
void  | SetAnchor (API_AnchorID anchor)
Sets the anchor position of the RoutingSegmentDefault.
void  | SetReferenceLineOffsetX (double offset)
Sets the offset from the reference line along the X-axis of cross-section's plane.
void  | SetReferenceLineOffsetY (double offset)
Sets the offset from the reference line along the Y-axis of cross-section's plane.
Result< void >  | SetWallThickness (double thickness)
Sets the wall thickness of the RoutingSegmentDefault.
Result< void >  | SetConnectionStyle (ConnectionStyle connectionStyle)
Sets the connection style of the RoutingSegmentDefault.
Result< void >  | SetFlangeSize (double flangeSize)
Sets the flange size (width for Ventilation, diameter for Piping) of the RoutingSegment if its connection style is Flanged.
Detailed Description
Modifier of the RoutingSegmentDefault.
Member Function Documentation
◆ SetAnchor()
 void ACAPI::MEP::RoutingSegmentDefault::Modifier::SetAnchor  |  ( |  API_AnchorID |  anchor | )
Sets the anchor position of the RoutingSegmentDefault.
Parameters
anchor | The value to be set.
◆ SetConnectionStyle()
 Result< void > ACAPI::MEP::RoutingSegmentDefault::Modifier::SetConnectionStyle  |  ( |  ConnectionStyle |  connectionStyle | )
Sets the connection style of the RoutingSegmentDefault.
Parameters
connectionStyle | The value to be set.
Returns
Returns an error if the RoutingSegmentDefault's domain does not support the provided connection style, otherwise nothing.
◆ SetCrossSectionHeight()
 Result< void > ACAPI::MEP::RoutingSegmentDefault::Modifier::SetCrossSectionHeight  |  ( |  double |  height | )
Sets the width of the RoutingSegmentDefault.
Parameters
height | The value to be set.
Returns
Returns error if the Cross Section Shape is Circular, otherwise nothing.
◆ SetCrossSectionReferenceId()
 Result< void > ACAPI::MEP::RoutingSegmentDefault::Modifier::SetCrossSectionReferenceId  |  ( |  uint32_t |  referenceId | )
Sets the referenceId of Circular Cross Section in the RoutingSegmentDefault.
Parameters
referenceId | The referenceId of the row from the Segment PreferenceTable. Only the valid row's ReferenceId can be set.
Returns
Returns an error if the Cross Section Shape is not Circular or the referenceId is not a valid row of the actual preferenceTable, otherwise nothing.
◆ SetCrossSectionShape()
 Result< void > ACAPI::MEP::RoutingSegmentDefault::Modifier::SetCrossSectionShape  |  ( |  ConnectorShape |  shape | )
Sets the shape of the RoutingSegmentDefault.
Parameters
shape | The value to be set.
Returns
Returns error if the shape is not supported by the RoutingSegment, otherwise nothing.
◆ SetCrossSectionWidth()
 Result< void > ACAPI::MEP::RoutingSegmentDefault::Modifier::SetCrossSectionWidth  |  ( |  double |  width | )
Sets the width of the RoutingSegmentDefault.
Parameters
width | The value to be set.
Returns
Returns error if the Cross Section Shape is Circular, otherwise nothing.
◆ SetFlangeSize()
 Result< void > ACAPI::MEP::RoutingSegmentDefault::Modifier::SetFlangeSize  |  ( |  double |  flangeSize | )
Sets the flange size (width for Ventilation, diameter for Piping) of the RoutingSegment if its connection style is Flanged.
Parameters
flangeSize | The value to be set.
Returns
Returns an error if the RoutingSegment's connection style is not Flanged, otherwise nothing.
◆ SetPreferenceTableId()
 Result< void > ACAPI::MEP::RoutingSegmentDefault::Modifier::SetPreferenceTableId  |  ( |  const UniqueID & |  uniqueId | )
Sets the PreferenceTable of the RoutingSegmentDefault.
Parameters
uniqueId | The UniqueID of the PreferenceTable.
Returns
Returns an error if the parameter does not identify a PreferenceTable, otherwise nothing.
◆ SetReferenceLineOffsetX()
 void ACAPI::MEP::RoutingSegmentDefault::Modifier::SetReferenceLineOffsetX  |  ( |  double |  offset | )
Sets the offset from the reference line along the X-axis of cross-section's plane.
Parameters
offset | The value to be set.
◆ SetReferenceLineOffsetY()
 void ACAPI::MEP::RoutingSegmentDefault::Modifier::SetReferenceLineOffsetY  |  ( |  double |  offset | )
Sets the offset from the reference line along the Y-axis of cross-section's plane.
Parameters
offset | The value to be set.
◆ SetRigidSegmentDefault()
 void ACAPI::MEP::RoutingSegmentDefault::Modifier::SetRigidSegmentDefault  |  ( |  const RigidSegmentDefault & |  rigidSegmentDefault | ) |   const
Sets the RigidSegment to the RoutingSegmentDefault.
Parameters
rigidSegmentDefault | The value to be set.
◆ SetWallThickness()
 Result< void > ACAPI::MEP::RoutingSegmentDefault::Modifier::SetWallThickness  |  ( |  double |  thickness | )
Sets the wall thickness of the RoutingSegmentDefault.
Parameters
thickness | The value to be set.
Returns
Returns an error if the RoutingSegmentDefault's wall thickness is controlled by its PreferenceTable, otherwise nothing.